app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---

<% current_user.attended_events.each do  |attended|%>