app/views/events/_feed.html.erb

      <p>
       <% y = event.attendances.last %>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ? ORDER BY "attendances"."id" DESC LIMIT ?  [["event_id", 1], ["LIMIT", 1]]

       <% mmm = [] %>
       <%  while i <= event.attendances.length do %>
       <% y = event.attendances.find(i) if event.attendances.find_by(id: i) != nil %> </br>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."id" = ? LIMIT ?  [["event_id", 1], ["id", 0], ["LIMIT", 1]]