app/controllers/attendances_controller.rb

  def create

    @attendances = Attendance.new(user_id: current_user.id, event_id: params[:event_id])

       if Attendance.find_by(event_id: params[:event_id]).nil?
        if @attendances.save
---
INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["event_id", 1], ["created_at", "2021-02-11 00:18:27.995659"], ["updated_at", "2021-02-11 00:18:27.995659"]]