app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "date", "location", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "description" = ?, "date" = ?, "location" = ?, "updated_at" = ?, "user_id" = ? WHERE "events"."id" = ?  [["description", ""], ["date", "2021-02-14 00:00:00"], ["location", ""], ["updated_at", "2021-02-11 16:03:50.579549"], ["user_id", 3], ["id", 1]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find(params[:id])